# LapSplicePosition Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricArea..::..LapSplicePosition Property
FabricArea Class See Also
---
The fabric lap splice position in the fabric distribution.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public FabricLapSplicePosition LapSplicePosition { get; set; }
```

Visual Basic
---
```text
Public Property LapSplicePosition As FabricLapSplicePosition
	Get
	Set
```

Visual C++
---
```text
public:
property FabricLapSplicePosition LapSplicePosition {
	FabricLapSplicePosition get ();
	void set (FabricLapSplicePosition value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace